Repository: Lin0u0/InkPond
Catalog: InkPond/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant_hk

# icloud.sync_footer.on
source: Project files are stored in iCloud Drive and sync through iCloud.
zh_hans: 项目文件会存放在 iCloud 云盘，并通过 iCloud 同步。
zh_hant_hk: 專案檔案會存放在 iCloud 雲碟，並透過 iCloud 同步。

# icloud.sync_packages_toggle
source: Sync Packages
zh_hans: 同步包
zh_hant_hk: 同步套件

# icloud.sync_snippets_toggle
source: Sync Snippets
zh_hans: 同步代码片段
zh_hant_hk: 同步程式碼片段

# icloud.sync_toggle
source: Sync Projects
zh_hans: 同步项目
zh_hant_hk: 同步專案

source: Image Directory
zh_hans: 图片目录
zh_hant_hk: 圖片目錄

source: Image Import Error
zh_hans: 图片导入错误
zh_hant_hk: 圖片匯入錯誤

source: Image Insertion
zh_hans: 图片插入
zh_hant_hk: 圖片插入

source: Images
zh_hans: 图片
zh_hant_hk: 圖片

source: Import Error
zh_hans: 导入错误
zh_hant_hk: 匯入錯誤

source: Import File
zh_hans: 导入文件
zh_hant_hk: 匯入檔案

source: Import Project
zh_hans: 导入项目
zh_hant_hk: 匯入專案

source: Import ZIP
zh_hans: 导入 ZIP
zh_hant_hk: 匯入 ZIP

source: InkPond could not find any .typ files in this project.
zh_hans: 墨池在这个项目中没有找到任何 .typ 文件。
zh_hant_hk: 墨池在這個專案中找不到任何 .typ 檔案。

source: Latte · Light
zh_hans: Latte · 浅色
zh_hant_hk: Latte · 淺色

source: Light
zh_hans: 浅色
zh_hant_hk: 淺色

# local_packages.actions
source: Package Actions
zh_hans: 包操作
zh_hant_hk: 套件操作

# local_packages.change_namespace
source: Change Namespace
zh_hans: 修改命名空间
zh_hant_hk: 更改命名空間

# local_packages.change_namespace_body
source: Move this package to a different namespace so you can import it with a new @namespace/name path.
zh_hans: 把这个包移动到新的命名空间，这样你就可以用新的 @namespace/name 路径导入它。
zh_hant_hk: 將這個套件移到新的命名空間，之後就可以用新的 @namespace/name 路徑匯入。

# local_packages.change_namespace_placeholder
source: Namespace
zh_hans: 命名空间
zh_hant_hk: 命名空間

# local_packages.change_namespace_title
source: Change Package Namespace
zh_hans: 修改包命名空间
zh_hant_hk: 更改套件命名空間

# local_packages.clear_all_button
source: Remove All
zh_hans: 全部移除
zh_hant_hk: 全部移除

# local_packages.clear_all_message
source: This removes all installed local packages. Documents using them will fail to compile until the packages are re-imported.
zh_hans: 这会移除所有已安装的本地包。使用这些包的文档将无法编译，直到重新导入。
zh_hant_hk: 這會移除所有已安裝的本地套件。使用這些套件的文件將無法編譯，直到重新匯入。

# local_packages.clear_all_title
source: Remove All Local Packages?
zh_hans: 移除所有本地包？
zh_hant_hk: 移除所有本地套件？

# local_packages.empty
source: No local packages installed
zh_hans: 没有已安装的本地包
zh_hant_hk: 沒有已安裝的本地套件

# local_packages.import
source: Import Packages
zh_hans: 导入包
zh_hant_hk: 匯入套件

# local_packages.import_detail
source: Select one or more package archives to import.
zh_hans: 选择一个或多个包压缩文件来导入。
zh_hant_hk: 選取一個或多個套件壓縮檔來匯入。

# local_packages.import_folder
source: Import Folder Contents
zh_hans: 导入整个文件夹
zh_hant_hk: 匯入整個資料夾

# local_packages.import_folder_detail
source: Pick one folder and import every package inside.
zh_hans: 选一个文件夹，把里面所有包都导入。
zh_hant_hk: 選一個資料夾，把裡面的所有套件都匯入。

# local_packages.import_tips.footer
source: Select multiple archives (.zip, .tar, .tar.gz) at once to batch import, or pick a single folder. Each package must contain a typst.toml manifest. You can also place unarchived package folders directly into the LocalPackages directory via the Files app — they will be picked up automatically.
zh_hans: 可一次选择多个压缩包（.zip、.tar、.tar.gz）批量导入，或选择单个文件夹。每个包必须包含 typst.toml 清单文件。 你也可以通过「文件」App 将未压缩的包文件夹直接放入 LocalPackages 目录，应用会自动识别。
zh_hant_hk: 可一次選取多個壓縮檔（.zip、.tar、.tar.gz）批次匯入，或選取單個資料夾。每個套件必須包含 typst.toml 清單檔案。 你亦可透過「檔案」App 將未壓縮的套件資料夾直接放入 LocalPackages 目錄，應用會自動識別。

# local_packages.imported
source: Packages Imported
zh_hans: 包已导入
zh_hant_hk: 套件已匯入

# local_packages.imported_archive_note
source: Unpacked %d archive imports.
zh_hans: 已解压 %d 个压缩包导入项。
zh_hant_hk: 已解壓 %d 個壓縮檔匯入項目。

# local_packages.imported_downloaded_note
source: Downloaded %d iCloud items before import.
zh_hans: 导入前已从 iCloud 下载 %d 个项目。
zh_hant_hk: 匯入前已從 iCloud 下載 %d 個項目。

# local_packages.imported_message
source: Successfully imported %@. You can now use it in your documents.
zh_hans: 已成功导入 %@，现在可以在文档中使用了。
zh_hant_hk: 已成功匯入 %@，現在可以在文件中使用。

# local_packages.info_body
source: Import package folders or .zip, .tar, .tar.gz, and .tgz archives containing a typst.toml manifest. Use them in your documents with #import "@namespace/name:version". Set the namespace below, or add a namespace field in typst.toml to override per package.
zh_hans: 导入包含 typst.toml 清单文件的包文件夹，或 .zip、.tar、.tar.gz、.tgz 压缩包。在文档中通过 #import "@namespace/name:version" 使用。在下方设置命名空间，或在 typst.toml 中添加 namespace 字段来单独覆盖。
zh_hant_hk: 匯入包含 typst.toml 清單檔案的套件資料夾，或 .zip、.tar、.tar.gz、.tgz 壓縮檔。在文件中透過 #import "@namespace/name:version" 使用。在下方設定命名空間，或在 typst.toml 中加入 namespace 欄位來個別覆蓋。

# local_packages.info_title
source: About Local Packages
zh_hans: 关于本地包
zh_hant_hk: 關於本地套件

# local_packages.namespace
source: Default Namespace
zh_hans: 默认命名空间
zh_hant_hk: 預設命名空間

# local_packages.namespace_hint
source: Used when an imported package does not declare a namespace in typst.toml.
zh_hans: 当导入的包没有在 typst.toml 中声明 namespace 时，会使用这里的值。
zh_hant_hk: 當匯入的套件沒有在 typst.toml 中宣告 namespace 時，會使用這裡的值。

# local_packages.namespace_updated_message
source: Moved %@ to %@.
zh_hans: 已将 %@ 移动到 %@。
zh_hant_hk: 已將 %@ 移動到 %@。

# local_packages.section_title
source: Installed Packages
zh_hans: 已安装的包
zh_hant_hk: 已安裝的套件

# local_packages.status.changing_namespace
source: Changing namespace for %@…
zh_hans: 正在修改 %@ 的命名空间…
zh_hant_hk: 正在更改 %@ 的命名空間⋯

# local_packages.status.importing
source: Importing %@…
zh_hans: 正在导入 %@…
zh_hant_hk: 正在匯入 %@⋯

# local_packages.status.scanning
source: Scanning %@…
zh_hans: 正在扫描 %@…
zh_hant_hk: 正在掃描 %@⋯

# local_packages.success_title
source: Local Packages
zh_hans: 本地包
zh_hant_hk: 本地套件

# local_packages.title
source: Local Packages
zh_hans: 本地包
zh_hant_hk: 本地套件

source: Manage Compile Cache
zh_hans: 管理编译缓存
zh_hant_hk: 管理編譯快取

source: Manage Package Cache
zh_hans: 管理包缓存
zh_hant_hk: 管理套件快取

source: Manage System Font Cache
zh_hans: 管理系统字体缓存
zh_hant_hk: 管理系統字型快取

source: Mocha · Dark
zh_hans: Mocha · 深色
zh_hant_hk: Mocha · 深色

source: Mode
zh_hans: 模式
zh_hant_hk: 模式

# network.status.connected
source: Connected
zh_hans: 已连接
zh_hant_hk: 已連線

# network.status.constrained
source: Connected (limited)
zh_hans: 已连接（受限）
zh_hant_hk: 已連線（受限）

# network.status.disconnected
source: No network connection
zh_hans: 无网络连接
zh_hant_hk: 無網絡連線

# network.status.expensive
source: Connected (cellular)
zh_hans: 已连接（蜂窝数据）
zh_hant_hk: 已連線（流動數據）

source: New .typ File
zh_hans: 新建 .typ 文件
zh_hant_hk: 新增 .typ 檔案

source: New Source File
zh_hans: 新建源文件
zh_hant_hk: 新增原始檔

source: No .typ files
zh_hans: 没有 .typ 文件
zh_hant_hk: 沒有 .typ 檔案

source: No .typ Files Found
zh_hans: 未找到 .typ 文件
zh_hant_hk: 找不到 .typ 檔案

source: No cached @preview packages
zh_hans: 没有已缓存的 @preview 包
zh_hant_hk: 沒有已快取的 @preview 套件

source: No cached document previews
zh_hans: 没有已缓存的文档预览
zh_hant_hk: 沒有已快取的文件預覽

source: No cached system fonts
zh_hans: 没有已缓存的系统字体
zh_hant_hk: 沒有已快取的系統字型

source: No Document Selected
zh_hans: 未选择文档
zh_hant_hk: 未選取文件

source: No files
zh_hans: 没有文件
zh_hant_hk: 沒有檔案

source: No fonts
zh_hans: 没有字体
zh_hant_hk: 沒有字型

source: No images
zh_hans: 没有图片
zh_hant_hk: 沒有圖片

source: OK
zh_hans: 确定
zh_hant_hk: 確定

# onboarding.action.get_started
source: Get Started
zh_hans: 开始使用
zh_hant_hk: 開始使用

# onboarding.action.get_started.hint
source: Open the document library.
zh_hans: 打开文档列表。
zh_hant_hk: 打開文件列表。

# onboarding.continue.hint
source: Show the next introduction page.
zh_hans: 显示下一页介绍。
zh_hant_hk: 顯示下一頁介紹。

# onboarding.editor.subtitle
source: Syntax highlighting, completions, snippets, and a Typst keyboard stay close to the text.
zh_hans: 语法高亮、自动补全、代码片段和 Typst 键盘始终贴近文本。
zh_hant_hk: 語法醒目提示、自動補全、程式碼片段和 Typst 鍵盤始終貼近文字。

# onboarding.editor.title
source: Write with Typst
zh_hans: 用 Typst 写作
zh_hant_hk: 用 Typst 寫作

# onboarding.preview.subtitle
source: Compiled PDF and source stay side by side with tap-to-jump sync.
zh_hans: 编译后的 PDF 与源码并排显示，点击即可在两侧同步跳转。
zh_hant_hk: 編譯後的 PDF 與源碼並排顯示，點按即可在兩側同步跳轉。

# onboarding.preview.title
source: Preview as you edit
zh_hans: 边写边预览
zh_hant_hk: 邊寫邊預覽

# onboarding.projects.subtitle
source: Source files, images, fonts, and ZIP export live together per document.
zh_hans: 源文件、图片、字体和 ZIP 导出都随每个文档放在一起。
zh_hant_hk: 源碼檔案、圖片、字型和 ZIP 匯出都隨每份文件放在一起。

# onboarding.projects.title
source: Keep projects whole
zh_hans: 完整管理项目
zh_hant_hk: 完整管理專案

# onboarding.welcome.subtitle
source: A focused Typst workspace for writing, compiling, and managing polished documents on iPad and iPhone.
zh_hans: 一处专注的 Typst 工作台，在 iPad 和 iPhone 上写作、编译和管理排版文档。
zh_hant_hk: 一個專注的 Typst 工作台，讓你在 iPad 和 iPhone 上寫作、編譯和管理排版文件。

# onboarding.welcome.title
source: InkPond
zh_hans: 墨池
zh_hant_hk: 墨池

# outline.empty.message
source: Add headings with = in your Typst document to see an outline.
zh_hans: 在 Typst 文档中使用 = 添加标题即可查看大纲。
zh_hant_hk: 在 Typst 文件中使用 = 新增標題即可查看大綱。

# outline.empty.title
source: No Headings
zh_hans: 没有标题
zh_hant_hk: 沒有標題

# outline.title
source: Outline
zh_hans: 大纲
zh_hant_hk: 大綱

source: Overview
zh_hans: 概览
zh_hant_hk: 概覽

source: Package Cache
zh_hans: 包缓存
zh_hant_hk: 套件快取

source: Packages
zh_hans: 包
zh_hant_hk: 套件

source: Preview
zh_hans: 预览
zh_hant_hk: 預覽

# preview.external_link_required.button
source: Link Folder
zh_hans: 关联文件夹
zh_hant_hk: 連結資料夾

# preview.external_link_required.folder_mismatch
source: The selected folder must contain the opened .typ file.
zh_hans: 所选文件夹必须包含当前打开的 .typ 文件。
zh_hant_hk: 所選資料夾必須包含目前開啟的 .typ 檔案。

# preview.external_link_required.message
source: This file was opened as a single .typ file. Link its folder to compile templates, images, fonts, and other local dependencies.
zh_hans: 此文件以单个 .typ 文件打开。请关联所在文件夹，才能编译模板、图片、字体和其他本地依赖。
zh_hant_hk: 此檔案以單個 .typ 檔案開啟。請連結所在資料夾，才能編譯範本、圖片、字型和其他本地依賴。

# preview.external_link_required.missing_source
source: The opened external .typ file is no longer available.
zh_hans: 当前打开的外部 .typ 文件已不可用。
zh_hant_hk: 目前開啟的外部 .typ 檔案已不可用。

# preview.external_link_required.title
source: Link External Folder to preview
zh_hans: 需要 Link External Folder 才能预览
zh_hant_hk: 需要 Link External Folder 才能預覽

# preview.stats.a11y.hint.collapsed
source: Double-tap to show word and character counts.
zh_hans: 双击展开字数和字符统计。
zh_hant_hk: 點兩下展開字數與字元統計。

# preview.stats.a11y.hint.expanded
source: Double-tap to collapse the extra statistics.
zh_hans: 双击收起详细统计。
zh_hant_hk: 點兩下收起詳細統計。

# preview.stats.characters
source: %d characters
zh_hans: %d 字符
zh_hant_hk: %d 字元

# preview.stats.characters.label
source: Characters
zh_hans: 字符数
zh_hant_hk: 字元數

# preview.stats.pages
source: %d pages
zh_hans: %d 页
zh_hant_hk: %d 頁

# preview.stats.tokens
source: %d tokens
zh_hans: %d 字
zh_hant_hk: %d 字

# preview.stats.tokens.label
source: Tokens
zh_hans: 字数
zh_hant_hk: 字數

# preview.stats.words
source: %d words
zh_hans: %d 字
zh_hant_hk: %d 字

# preview.stats.words.label
source: Words
zh_hans: 字数
zh_hant_hk: 字數

source: Project Error
zh_hans: 项目错误
zh_hant_hk: 專案錯誤

source: Project Files
zh_hans: 项目文件
zh_hant_hk: 專案檔案

source: Project Root
zh_hans: 项目根目录
zh_hant_hk: 專案根目錄

source: Project Settings
zh_hans: 项目设置
zh_hant_hk: 專案設定

# project_fonts.empty
source: No project fonts
zh_hans: 没有项目字体
zh_hant_hk: 沒有專案字型

# project_fonts.footer
source: App fonts are available to every project. Add Font imports project-only fonts.
zh_hans: App 字体对所有项目可用；“添加字体”会导入仅当前项目可用的字体。
zh_hant_hk: App 字型可供所有專案使用；「新增字型」會匯入僅目前專案可用的字型。

# project_fonts.title
source: Project Fonts
zh_hans: 项目字体
zh_hant_hk: 專案字型

source: Projects
zh_hans: 项目
zh_hant_hk: 專案

source: Recompile
zh_hans: 重新编译
zh_hant_hk: 重新編譯

source: Reference implementation for Swift/Rust interop.
zh_hans: Swift/Rust 互操作方案的参考实现。
zh_hant_hk: Swift/Rust 互操作方案的參考實作。

source: Regular
zh_hans: 常规
zh_hant_hk: 標準

source: Rename
zh_hans: 重命名
zh_hant_hk: 重新命名

source: Rename Document
zh_hans: 重命名文档
zh_hant_hk: 重新命名文件

# resume.alert.action.resume
source: Resume
zh_hans: 继续
zh_hant_hk: 繼續

# resume.alert.action.start_from_top
source: Start from Top
zh_hans: 从头开始
zh_hant_hk: 從頭開始

# resume.alert.message
source: Return to where you left off last time?
zh_hans: 返回上次离开的位置？
zh_hant_hk: 返回上次離開的位置？

# resume.alert.message_with_file
source: Return to %@ where you left off last time?
zh_hans: 返回上次在 %@ 中离开的位置？
zh_hant_hk: 返回上次在 %@ 中離開的位置？

# resume.alert.title
source: Resume Editing?
zh_hans: 继续编辑？
zh_hant_hk: 繼續編輯？

# resume.banner.a11y_hint
source: Tap to jump back to your last editing position
zh_hans: 点击跳转到上次编辑位置
zh_hant_hk: 點擊跳轉到上次編輯位置

# resume.banner.label
source: Resume where you left off
zh_hans: 返回上次编辑位置
zh_hant_hk: 返回上次編輯位置

# resume.banner.label_with_file
source: Resume in %@
zh_hans: 返回 %@ 继续编辑
zh_hant_hk: 返回 %@ 繼續編輯

source: Save
zh_hans: 保存
zh_hant_hk: 儲存

source: Search
zh_hans: 搜索
zh_hant_hk: 搜尋

source: Search Fonts
zh_hans: 搜索字体
zh_hant_hk: 搜尋字型

source: Select a document from the list or create a new one.
zh_hans: 请从列表中选择文档，或新建一个文档。
zh_hant_hk: 請從清單中選擇文件，或建立新文件。

source: Selecting a font directory imports its font files into the project font library. You can also skip this step.
zh_hans: 选择字体目录后，会将其中的字体文件导入项目字体库。你也可以跳过这一步。
zh_hant_hk: 選擇字型目錄後，會將其中的字型檔匯入專案字型庫。你也可以略過這一步。

source: Settings
zh_hans: 设置
zh_hant_hk: 設定

# settings.feedback.github_issues.hint
source: Opens GitHub Issues to report bugs or share suggestions.
zh_hans: 打开 GitHub Issues 反馈问题或建议。
zh_hant_hk: 打開 GitHub Issues 回報問題或分享建議。

# settings.feedback.section
source: Feedback
zh_hans: 反馈
zh_hant_hk: 意見回饋

# settings.import_link.section
source: Import & Link
zh_hans: 导入与链接
zh_hant_hk: 匯入與連結

# settings.version_format
source: Version %@ (%@)
zh_hans: 版本 %@（%@）
zh_hant_hk: 版本 %@（%@）

source: Share
zh_hans: 分享
zh_hant_hk: 分享

source: Share PDF
zh_hans: 分享 PDF
zh_hant_hk: 分享 PDF

# shortcuts.completion.confirm
source: Confirm selection
zh_hans: 确认选择
zh_hant_hk: 確認選擇

# shortcuts.completion.dismiss
source: Dismiss
zh_hans: 关闭
zh_hant_hk: 關閉

# shortcuts.completion.navigate
source: Navigate suggestions
zh_hans: 浏览建议
zh_hant_hk: 瀏覽建議

# shortcuts.general.find_replace
source: Find & Replace
zh_hans: 查找与替换
zh_hant_hk: 尋找及取代

# shortcuts.section.completion
source: Completion
zh_hans: 补全
zh_hant_hk: 補全

# shortcuts.section.general
source: General
zh_hans: 通用
zh_hant_hk: 一般

# shortcuts.section.system
source: System
zh_hans: 系统
zh_hant_hk: 系統

# shortcuts.system.copy
source: Copy
zh_hans: 拷贝
zh_hant_hk: 拷貝

# shortcuts.system.cut
source: Cut
zh_hans: 剪切
zh_hant_hk: 剪下

# shortcuts.system.paste
source: Paste
zh_hans: 粘贴
zh_hant_hk: 貼上

# shortcuts.system.redo
source: Redo
zh_hans: 重做
zh_hant_hk: 重做

# shortcuts.system.select_all
source: Select All
zh_hans: 全选
zh_hant_hk: 全選

# shortcuts.system.undo
source: Undo
zh_hans: 撤销
zh_hant_hk: 復原

# shortcuts.title
source: Keyboard Shortcuts
zh_hans: 键盘快捷键
zh_hant_hk: 鍵盤快捷鍵

source: Show Details
zh_hans: 显示详情
zh_hant_hk: 顯示詳情

source: Size
zh_hans: 大小
zh_hant_hk: 大小

source: Skip
zh_hans: 跳过
zh_hant_hk: 略過

source: Slideshow
zh_hans: 幻灯片
zh_hant_hk: 幻燈片

# snippet.action.edit
source: Edit
zh_hans: 编辑
zh_hant_hk: 編輯

# snippet.action.new
source: New Snippet
zh_hans: 新建片段
zh_hant_hk: 新增片段

# snippet.badge.custom
source: Custom
zh_hans: 自定义
zh_hant_hk: 自訂

# snippet.builtin.category.bibliography
source: Bibliography
zh_hans: 参考文献
zh_hant_hk: 參考文獻

# snippet.builtin.category.code
source: Code
zh_hans: 代码
zh_hant_hk: 程式碼

# snippet.builtin.category.document_setup
source: Document Setup
zh_hans: 文档设置
zh_hant_hk: 文件設定

# snippet.builtin.category.figure_table
source: Figure & Table
zh_hans: 图表与表格
zh_hant_hk: 圖片與表格

# snippet.builtin.category.layout
source: Layout
zh_hans: 布局
zh_hant_hk: 版面配置

# snippet.builtin.category.math
source: Math
zh_hans: 数学
zh_hant_hk: 數學

# snippet.builtin.title.aligned_equations
source: Aligned Equations
zh_hans: 对齐公式
zh_hant_hk: 對齊方程式

# snippet.builtin.title.article_template
source: Article Template
zh_hans: 文章模板
zh_hant_hk: 文章範本

# snippet.builtin.title.basic_document
source: Basic Document
zh_hans: 基础文档
zh_hant_hk: 基礎文件

# snippet.builtin.title.bibliography_setup
source: Bibliography Setup
zh_hans: 参考文献设置
zh_hant_hk: 參考文獻設定

# snippet.builtin.title.centered_block
source: Centered Block
zh_hans: 居中块
zh_hant_hk: 置中區塊

# snippet.builtin.title.citation
source: Citation
zh_hans: 引用
zh_hant_hk: 引用

# snippet.builtin.title.code_block
source: Code Block
zh_hans: 代码块
zh_hant_hk: 程式碼區塊

# snippet.builtin.title.code_block_with_caption
source: Code Block with Caption
zh_hans: 带题注的代码块
zh_hant_hk: 附標題程式碼區塊

# snippet.builtin.title.display_math
source: Display Math
zh_hans: 独立公式
zh_hant_hk: 獨立數學公式

# snippet.builtin.title.figure_with_caption
source: Figure with Caption
zh_hans: 带题注的图片
zh_hant_hk: 附標題圖片

# snippet.builtin.title.inline_code
source: Inline Code
zh_hans: 行内代码
zh_hant_hk: 行內程式碼

# snippet.builtin.title.inline_math
source: Inline Math
zh_hans: 行内公式
zh_hant_hk: 行內數學

# snippet.builtin.title.letter_template
source: Letter Template
zh_hans: 书信模板
zh_hant_hk: 書信範本

# snippet.builtin.title.matrix
source: Matrix
zh_hans: 矩阵
zh_hant_hk: 矩陣

# snippet.builtin.title.page_break
source: Page Break
zh_hans: 分页符
zh_hant_hk: 分頁符號

# snippet.builtin.title.presentation_slide
source: Presentation Slide
zh_hans: 演示幻灯片
zh_hant_hk: 簡報投影片

# snippet.builtin.title.table_three_columns
source: Table (3 Columns)
zh_hans: 表格（3 列）
zh_hant_hk: 表格（3 欄）

# snippet.builtin.title.table_two_columns
source: Table (2 Columns)
zh_hans: 表格（2 列）
zh_hant_hk: 表格（2 欄）

# snippet.builtin.title.two_columns
source: Two Columns
zh_hans: 双栏
zh_hant_hk: 雙欄

# snippet.editor.action.custom_category
source: Custom Category…
zh_hans: 自定义分类…
zh_hant_hk: 自訂分類…

# snippet.editor.action.pick_category
source: Pick Existing Category
zh_hans: 选择已有分类
zh_hant_hk: 揀選已有分類

# snippet.editor.action.save
source: Save
zh_hans: 保存
zh_hant_hk: 儲存

# snippet.editor.body.hint
source: Use $0 to mark cursor position after insertion.
zh_hans: 使用 $0 标记插入后的光标位置。
zh_hant_hk: 使用 $0 標記插入後的游標位置。

# snippet.editor.field.category
source: Category
zh_hans: 分类
zh_hant_hk: 分類

# snippet.editor.field.title
source: Title
zh_hans: 标题
zh_hant_hk: 標題

# snippet.editor.section.body
source: Body
zh_hans: 内容
zh_hant_hk: 內容

# snippet.editor.section.details
source: Details
zh_hans: 详情
zh_hant_hk: 詳情

# snippet.editor.title.edit
source: Edit Snippet
zh_hans: 编辑片段
zh_hant_hk: 編輯片段

# snippet.editor.title.new
source: New Snippet
zh_hans: 新建片段
zh_hant_hk: 新增片段

# snippet.search.prompt
source: Search snippets
zh_hans: 搜索代码片段
zh_hant_hk: 搜尋代碼片段

# snippet.title
source: Snippets
zh_hans: 代码片段
zh_hant_hk: 代碼片段

source: Soothing pastel color palette powering the editor themes.
zh_hans: 编辑器主题所用的柔和马卡龙配色。
zh_hant_hk: 編輯器主題採用的柔和粉彩配色。

# sort.created_newest
source: Recently Created
zh_hans: 最近创建
zh_hant_hk: 最近建立

# sort.created_oldest
source: Oldest Created
zh_hans: 最早创建
zh_hant_hk: 最早建立

# sort.direction.ascending
source: Ascending
zh_hans: 升序
zh_hant_hk: 遞增

# sort.direction.descending
source: Descending
zh_hans: 降序
zh_hant_hk: 遞減

# sort.field.created
source: Date Created
zh_hans: 创建日期
zh_hant_hk: 建立日期

# sort.field.modified
source: Date Modified
zh_hans: 修改日期
zh_hant_hk: 修改日期

# sort.field.title
source: Name
zh_hans: 名称
zh_hant_hk: 名稱

# sort.menu.button
source: Sort
zh_hans: 排序
zh_hant_hk: 排序

# sort.menu.order
source: Order
zh_hans: 排序顺序
zh_hant_hk: 排序順序

# sort.menu.sort_by
source: Sort By
zh_hans: 排序方式
zh_hant_hk: 排序方式

# sort.modified_newest
source: Recently Modified
zh_hans: 最近修改
zh_hant_hk: 最近修改

# sort.modified_oldest
source: Oldest Modified
zh_hans: 最早修改
zh_hant_hk: 最早修改

# sort.title_az
source: Title (A-Z)
zh_hans: 标题（A-Z）
zh_hant_hk: 標題（A-Z）

# sort.title_za
source: Title (Z-A)
zh_hans: 标题（Z-A）
zh_hant_hk: 標題（Z-A）

source: Source Files
zh_hans: 源文件
zh_hant_hk: 原始檔

source: Special Thanks
zh_hans: 特别感谢
zh_hant_hk: 特別感謝

source: Start typing to see a live preview
zh_hans: 开始输入以查看实时预览
zh_hant_hk: 開始輸入即可查看即時預覽

source: Style
zh_hans: 样式
zh_hant_hk: 樣式

source: Subdirectory name
zh_hans: 子目录名称
zh_hant_hk: 子目錄名稱

source: System Font Cache
zh_hans: 系统字体缓存
zh_hant_hk: 系統字型快取

source: Thanks to everyone at Donut for support and inspiration.
zh_hans: 感谢甜甜圈的所有伙伴给予的支持与启发。
zh_hant_hk: 感謝甜甜圈的所有夥伴給予的支持與啟發。

source: The open-source typesetting system at the core of InkPond.
zh_hans: 墨池核心使用的开源排版系统。
zh_hant_hk: 墨池核心使用的開源排版系統。

source: This project does not include main.typ. Choose the file used for compilation.
zh_hans: 这个项目不包含 main.typ。请选择用于编译的文件。
zh_hant_hk: 這個專案不包含 main.typ。請選擇用於編譯的檔案。

source: This removes all cached compiled PDF previews. Documents will recompile the next time they open.
zh_hans: 这会移除所有已缓存的编译 PDF 预览。文档下次打开时会重新编译。
zh_hant_hk: 這會移除所有已快取的編譯 PDF 預覽。文件下次打開時會重新編譯。

source: This removes all downloaded @preview packages. They will be downloaded again on the next compile.
zh_hans: 这会移除所有已下载的 @preview 包。下次编译时会重新下载。
zh_hant_hk: 這會移除所有已下載的 @preview 套件，下次編譯時會重新下載。

source: This removes generated system font files. InkPond will rebuild them the next time a document needs them.
zh_hans: 这会删除生成的系统字体文件。下次文档需要时，墨池会重新生成。
zh_hant_hk: 這會刪除生成的系統字型檔案。下次文件需要時，墨池會重新生成。

source: Title
zh_hans: 标题
zh_hant_hk: 標題

# toast.image_inserted.multiple
source: Inserted %d images
zh_hans: 已插入 %d 张图片
zh_hant_hk: 已插入 %d 張圖片

# toast.image_inserted.single
source: Inserted %@
zh_hans: 已插入 %@
zh_hant_hk: 已插入 %@

source: Total Size
zh_hans: 总大小
zh_hant_hk: 總大小

# ui_test.sample_document_title
source: UI Test Sample
zh_hans: UI 测试示例
zh_hant_hk: UI 測試範例

source: Unlink
zh_hans: 解除链接
zh_hant_hk: 解除連結

source: Unlink Folder
zh_hans: 解除链接文件夹
zh_hant_hk: 解除連結資料夾

source: Updated %@
zh_hans: 更新于 %@
zh_hant_hk: 更新於 %@

# warning.font_fallback.dismiss
source: Dismiss font fallback warning
zh_hans: 关闭 fallback 字体警告
zh_hant_hk: 關閉 fallback 字型警告

# warning.font_fallback.message
source: Some text may render with fallback font "%@" because the selected font does not cover every character.
zh_hans: 部分文本可能会使用 fallback 字体“%@”渲染，因为当前选择的字体没有覆盖所有字符。
zh_hant_hk: 部分文字可能會使用 fallback 字型「%@」顯示，因為目前選擇的字型沒有覆蓋所有字元。

# warning.font_fallback.title
source: Font Fallback
zh_hans: 使用了 fallback 字体
zh_hant_hk: 使用了 fallback 字型
